app/helpers/application_helper.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "gui.eng.santos@gmail.com"], ["LIMIT", 1]]
---
    def current_user
        @current_user ||= User.find_by(email: session[:email])