app/controllers/purchases_controller.rb

  def post_file(user=@current_user, req_params=params)
    if @current_user != nil
      items = receive_file_and_parse req_params[:purchase][:file]
      @gross_income = 0
      unless items.empty?
          items.each do |item|
            @gross_income = @gross_income + income(item)
            item[:user_id]= @current_user[:id]
            Purchase.create(item)
---
SELECT "purchases".* FROM "purchases"
INSERT INTO "purchases" ("purchaser_name", "item_description", "item_price", "purchase_count", "merchant_address", "merchant_name", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def get_all_time(user=@current_user)
    @all_time_gross_income = 0
    if user!= nil
      purchases = Purchase.all
      purchases.each do |item|
---
SELECT "purchases".* FROM "purchases"