app/controllers/purchases_controller.rb

  def get_all_time(user=@current_user)
    @all_time_gross_income = 0
    if user!= nil
      purchases = Purchase.all
---
SELECT "purchases".* FROM "purchases"