app/controllers/sessions_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Guilherme Souza"], ["email", "gui.eng.santos@gmail.com"], ["created_at", "2021-06-05 12:40:24.053542"], ["updated_at", "2021-06-05 12:40:24.053542"]]
SELECT  "users".* FROM "users" WHERE "users"."email" = ? AND "users"."name" = ? LIMIT ?  [["email", "gui.eng.santos@gmail.com"], ["name", "Guilherme Souza"], ["LIMIT", 1]]
---
  def googleAuth
    info = request.env["omniauth.auth"].info
    user=User.find_or_create_by({email: info[:email], name: info[:name]})